Портал_EDT/src/InformationRegisters/Аук_ДанныеТаблицПодведенияИтогов/Аук_ДанныеТаблицПодведенияИтогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аук_ДанныеТаблицПодведенияИтогов</name>
  <resources>
    <name>РаспределяемаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоПобедитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.УБД_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Аук_УчастникиАукционов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Портал_EDT/src/InformationRegisters/Аук_ИсторияДанныхАукционов/Аук_ИсторияДанныхАукционов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аук_ИсторияДанныхАукционов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеЭлементаДанных</name>
    <type>
      <types>Characteristic.Аук_ЭлементыДанныхАукционов</types>
    </type>
  </resources>
  <attributes>
    <name>НаправлениеДанных</name>
    <type>
      <types>EnumRef.Аук_НаправленияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.Аук_ВидыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Аук_КонтактныеЛицаУчастниковАукционов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аукцион</name>
    <type>
      <types>CatalogRef.Аук_Аукционы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Аук_УчастникиАукционов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементДанных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Аук_ЭлементыДанныхАукционов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Портал_EDT/src/Enums/Аук_ВидыДанных/Аук_ВидыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Аук_ВидыДанных</name>
  <enumValues>
    <name>Ставка</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

Портал_EDT/src/InformationRegisters/Аук_ДанныеТаблицПодведенияИтогов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	сткРез = Аук_ОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "Аук_ДанныеТаблицПодведенияИтогов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;
	КонецЕсли;	
	
КонецФункции

Функция ДобавитьЗаписи(пМасЗаписи) Экспорт	
	
	сткРез = Аук_ОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМасЗаписи, "Аук_ДанныеТаблицПодведенияИтогов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;
	КонецЕсли;
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "Аук_ДанныеТаблицПодведенияИтогов");
	
КонецФункции	

Функция ТекущиеДанныеТаблицПодведенияИтогов(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ДанныеТаблицПодведенияИтогов.Участник КАК Участник,
	|	Аук_ДанныеТаблицПодведенияИтогов.СтрокаДанных КАК СтрокаДанных,
	|	Аук_ДанныеТаблицПодведенияИтогов.РаспределяемаяСумма КАК РаспределяемаяСумма,
	|	Аук_ДанныеТаблицПодведенияИтогов.ЭтоПобедитель КАК ЭтоПобедитель
	|ИЗ
	|	РегистрСведений.Аук_ДанныеТаблицПодведенияИтогов КАК Аук_ДанныеТаблицПодведенияИтогов
	|ГДЕ
	|	Аук_ДанныеТаблицПодведенияИтогов.Аукцион = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить();
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции	

Функция СтруктураЗаписи() Экспорт

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		);
	сткРезультат.Вставить("ИтогиАукциона",	);
	сткРезультат.Вставить("Автор",			?(ЗначениеЗаполнено(ПараметрыСеанса.глТекПользователь),
												ПараметрыСеанса.глТекПользователь,
												ПредопределенноеЗначение("Справочник.УБД_Пользователи.Система")));
												
	сткРезультат.Вставить("ДатаЗаписи",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	
	Возврат сткРезультат;
	
КонецФункции	

Функция ЗафиксироватьИтогиАукциона(пСткПараметры) Экспорт

	масЗаписи = Новый Массив;
	
	Для Каждого ЭлСоо Из пСткПараметры.ИтогиАукциона Цикл
		
		сткЗапись = Новый Структура;
		
		сткЗапись.Вставить("Аукцион",				пСткПараметры.Аукцион);
		сткЗапись.Вставить("Участник",				ЭлСоо["Участник"]);
		сткЗапись.Вставить("СтрокаДанных",			ЭлСоо["СтрокаДанных"]);
		сткЗапись.Вставить("РаспределяемаяСумма",	ЭлСоо["РаспределяемаяСумма"]);
		сткЗапись.Вставить("ЭтоПобедитель",			ЭлСоо["ЭтоПобедитель"]);
		сткЗапись.Вставить("Автор",					пСткПараметры.Автор);
		сткЗапись.Вставить("ДатаЗаписи",			пСткПараметры.ДатаЗаписи);
	
		масЗаписи.Добавить(сткЗапись);
		
	КонецЦикла;	
	
	Возврат ДобавитьЗаписи(масЗаписи);
	
КонецФункции	

Функция ДанныеСтавкиПобедителя(пСткОтбор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИсторияДанныхАукционов.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных,
	|	Аук_ЭлементыДанныхАукционов.Представление КАК ЭлементДанныхПредставление
	|ИЗ
	|	РегистрСведений.Аук_ДанныеТаблицПодведенияИтогов КАК Аук_ДанныеТаблицПодведенияИтогов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Аук_ИсторияДанныхАукционов.СрезПоследних КАК Аук_ИсторияДанныхАукционов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.Аук_ЭлементыДанныхАукционов КАК Аук_ЭлементыДанныхАукционов
	|			ПО Аук_ИсторияДанныхАукционов.ЭлементДанных = Аук_ЭлементыДанныхАукционов.Ссылка
	|		ПО Аук_ДанныеТаблицПодведенияИтогов.Аукцион = Аук_ИсторияДанныхАукционов.Аукцион
	|			И Аук_ДанныеТаблицПодведенияИтогов.Участник = Аук_ИсторияДанныхАукционов.Участник
	|			И Аук_ДанныеТаблицПодведенияИтогов.СтрокаДанных = Аук_ИсторияДанныхАукционов.СтрокаДанных
	|			И (Аук_ИсторияДанныхАукционов.ВидДанных = ЗНАЧЕНИЕ(Перечисление.Аук_ВидыДанных.Ставка))
	|ГДЕ
	|	Аук_ДанныеТаблицПодведенияИтогов.Аукцион = &Аукцион
	|	И Аук_ДанныеТаблицПодведенияИтогов.Участник = &Участник
	|	И Аук_ДанныеТаблицПодведенияИтогов.ЭтоПобедитель
	|	И Аук_ДанныеТаблицПодведенияИтогов.СтрокаДанных = &СтрокаДанных";
	
	Запрос.УстановитьПараметр("Аукцион",		пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("Участник",		пСткОтбор.Участник);
	Запрос.УстановитьПараметр("СтрокаДанных",	пСткОтбор.СтрокаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции	

#КонецОбласти
